[
  {
    "id": null,
    "name": "main",
    "prefix": "main",
    "helps": {
      "0": "**help 0**\nПривет! Ты попал на страницу help 0. Мои команды отличаются от сервера к серверу, некоторые не работают на других серверах. Можешь использовать help на серверах, чтобы узнать все уникальные команды и использовать help cmds, чтобы узнать межсерверные команды и информацию.\n**Короче, просто используй help 1, чтобы открыть слейдующую страницу поддержки 1 или, если страницы 1 нет, то ты можешь использовать help cmds, чтобы получить команды по умолчанию**",
      "cmds": "**Общие команды**\nВсе команды имеют аргумент второй help, там объяснсяется подробно как используется каждая команда, в скобках указан минимальный уровень доступа для использования команды (подробнее в help access)\n```\n1.  help -     (-1) Выдает справку по указанному имени\n2.  clear -    (0)  Удаляет n последних сообщений в канале\n3.  nn -       (-1) Работа со встроенными нейросетями\n4.  trans -    (-1) Переводчик текста\n5.  files -    (0)  Манипуляция файловой системой бота\n6.  perm -     (-1) Вывол текущего уровня доступа\n7.  plt -      (0)  Построение графика геометрической функции\n8.  init -     (0)  Инициализизует базовые файлы бота\n9.  reload -   (0)  Перезагрузка бота\n10. dialog -   (0)  Диалог с пользователями от имени бота\n11. send -     (0)  Отправляет сообщение от имени бота\n12. execute -  (0)  Выполняет строку python внутри функции\n13. ping -     (-1) Команда-попугай для тестирования бота\n14. log -      (0)  Управление системой логирования\n15. shutdown - (0)  Выключение бота\n```\nЭто не все мои команды, есть еще уникальные для каждого сервера. Чтобы узнать их пишите help cmds на других серверах",
      "access": "**Уровни доступа**\nДля использования команд бота нужно иметь необходимый уровень доступа.\n**Уровень доступа** - это число от -1 до бесконечности\n**Уровень -1** значит общий доступ, то есть доступ по умолчанию доступный всем.\n**Уровни от 0 до бесконечности** значат уже особый доступ, 0 - максимальный (уровень администратора), далее 1, он чуть слабее, 2 - тоже, ну и тд.\nВаш уровень доступа вы можете узнать комндой perm. Если вы взаимодействуете со мной в лс, то у вас будет всегда уровень -1, на моих серверах ваш уровень может быть уже в пределе от 0 до бесконечности.\n"
    }
  }
]